In [1]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [7]:
df=pd.read_csv(r"vgsales.csv")

In [8]:
df.head()

,Rank,Name,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,2006.0,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,1985.0,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,2008.0,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,2009.0,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,1996.0,11.27,8.89,10.22,1.00,31.37

In [9]:
df.tail()

,Rank,Name,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
16593,16596,Woody Woodpecker in Crazy Castle 5,2002.0,0.01,0.00,0.0,0.0,0.01
16594,16597,Men in Black II: Alien Escape,2003.0,0.01,0.00,0.0,0.0,0.01
16595,16598,SCORE International Baja 1000: The Official Game,2008.0,0.00,0.00,0.0,0.0,0.01
16596,16599,Know How 2,2010.0,0.00,0.01,0.0,0.0,0.01
16597,16600,Spirits & Spells,2003.0,0.01,0.00,0.0,0.0,0.01

In [16]:
print (df)

        Rank                                              Name    Year  \
0          1                                        Wii Sports  2006.0
1          2                                 Super Mario Bros.  1985.0
2          3                                    Mario Kart Wii  2008.0
3          4                                 Wii Sports Resort  2009.0
4          5                          Pokemon Red/Pokemon Blue  1996.0
...      ...                                               ...     ...
16593  16596                Woody Woodpecker in Crazy Castle 5  2002.0
16594  16597                     Men in Black II: Alien Escape  2003.0
16595  16598  SCORE International Baja 1000: The Official Game  2008.0
16596  16599                                        Know How 2  2010.0
16597  16600                                  Spirits & Spells  2003.0

       NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0         41.49     29.02      3.77         8.46         82.74
1         29.08      3.58      6.81         0.77         40.24
2         15.85     12.88      3.79         3.31         35.82
3         15.75     11.01      3.28         2.96         33.00
4         11.27      8.89     10.22         1.00         31.37
...         ...       ...       ...          ...           ...
16593      0.01      0.00      0.00         0.00          0.01
16594      0.01      0.00      0.00         0.00          0.01
16595      0.00      0.00      0.00         0.00          0.01
16596      0.00      0.01      0.00         0.00          0.01
16597      0.01      0.00      0.00         0.00          0.01

[16598 rows x 8 columns]

In [17]:
print (df.head(7))

   Rank                      Name    Year  NA_Sales  EU_Sales  JP_Sales  \
0     1                Wii Sports  2006.0     41.49     29.02      3.77
1     2         Super Mario Bros.  1985.0     29.08      3.58      6.81
2     3            Mario Kart Wii  2008.0     15.85     12.88      3.79
3     4         Wii Sports Resort  2009.0     15.75     11.01      3.28
4     5  Pokemon Red/Pokemon Blue  1996.0     11.27      8.89     10.22
5     6                    Tetris  1989.0     23.20      2.26      4.22
6     7     New Super Mario Bros.  2006.0     11.38      9.23      6.50

   Other_Sales  Global_Sales
0         8.46         82.74
1         0.77         40.24
2         3.31         35.82
3         2.96         33.00
4         1.00         31.37
5         0.58         30.26
6         2.90         30.01

In [ ]:
#you can also open this as text as shown below

In [20]:
#df_xls=pd.read_csv("vgsales.txt", delimiter='\t')

In [25]:

print(df)

        Rank                                              Name    Year  \
0          1                                        Wii Sports  2006.0
1          2                                 Super Mario Bros.  1985.0
2          3                                    Mario Kart Wii  2008.0
3          4                                 Wii Sports Resort  2009.0
4          5                          Pokemon Red/Pokemon Blue  1996.0
...      ...                                               ...     ...
16593  16596                Woody Woodpecker in Crazy Castle 5  2002.0
16594  16597                     Men in Black II: Alien Escape  2003.0
16595  16598  SCORE International Baja 1000: The Official Game  2008.0
16596  16599                                        Know How 2  2010.0
16597  16600                                  Spirits & Spells  2003.0

       NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0         41.49     29.02      3.77         8.46         82.74
1         29.08      3.58      6.81         0.77         40.24
2         15.85     12.88      3.79         3.31         35.82
3         15.75     11.01      3.28         2.96         33.00
4         11.27      8.89     10.22         1.00         31.37
...         ...       ...       ...          ...           ...
16593      0.01      0.00      0.00         0.00          0.01
16594      0.01      0.00      0.00         0.00          0.01
16595      0.00      0.00      0.00         0.00          0.01
16596      0.00      0.01      0.00         0.00          0.01
16597      0.01      0.00      0.00         0.00          0.01

[16598 rows x 8 columns]

In [ ]:
#Reading the headers in pandas

In [26]:
print (df.columns)

Index(['Rank', 'Name', 'Year', 'NA_Sales', 'EU_Sales', 'JP_Sales',
       'Other_Sales', 'Global_Sales'],
      dtype='object')

In [27]:
print(df['Name'])

0                                              Wii Sports
1                                       Super Mario Bros.
2                                          Mario Kart Wii
3                                       Wii Sports Resort
4                                Pokemon Red/Pokemon Blue
                               ...
16593                  Woody Woodpecker in Crazy Castle 5
16594                       Men in Black II: Alien Escape
16595    SCORE International Baja 1000: The Official Game
16596                                          Know How 2
16597                                    Spirits & Spells
Name: Name, Length: 16598, dtype: object

In [ ]:
#You can specify the number of names you want. e.g.

In [29]:
rint(df['Name'])

0                  Wii Sports
1           Super Mario Bros.
2              Mario Kart Wii
3           Wii Sports Resort
4    Pokemon Red/Pokemon Blue
Name: Name, dtype: object

In [ ]:
#we can locate the integer using iloc

In [30]:
print(df.iloc[10])

Rank                    11
Name            Nintendogs
Year                2005.0
NA_Sales              9.07
EU_Sales              11.0
JP_Sales              1.93
Other_Sales           2.75
Global_Sales         24.76
Name: 10, dtype: object

In [31]:
print(df.iloc[0:3])

   Rank               Name    Year  NA_Sales  EU_Sales  JP_Sales  Other_Sales  \
0     1         Wii Sports  2006.0     41.49     29.02      3.77         8.46
1     2  Super Mario Bros.  1985.0     29.08      3.58      6.81         0.77
2     3     Mario Kart Wii  2008.0     15.85     12.88      3.79         3.31

   Global_Sales
0         82.74
1         40.24
2         35.82